Tekla Open API Reference for Tekla Structures 2025
DrawingPluginBase.InputDefinition.InputTypes Enumeration
 The possible input types for a drawing plug-in.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum InputTypes
Public Enumeration InputTypes
Members
Member name | Value | Description
INPUT_ONE_POINT | 1 |  The input has one point.
INPUT_TWO_POINTS | 2 |  The input has two points.
INPUT_THREE_POINTS | 3 |  The input has three points.
INPUT_N_POINTS | 4 |  The input has multiple points.
INPUT_ONE_OBJECT | 5 |  The input has one drawing object. The supported drawing objects are bolts, parts and rebars. Bolts, parts and rebars are drawing objects derived from model objects. The parts include the beam, the contour plate and the polybeam.
See Also
Reference
Tekla.Structures.Plugins Namespace